app/services/clients/contacts_service.rb

SELECT "client_contacts".* FROM "client_contacts"
---
    def create_client_obj
      return if errors.any?
      @contact = ClientContact.new(params)
      @contact.save
      @errors << fill_errors(@contact) if @contact.errors.any?