app/services/clients/contacts_service.rb

    def contact_list
      @clients = ClientContact.where(client_id: params[:client_id])
---
SELECT "client_contacts".* FROM "client_contacts" WHERE "client_contacts"."client_id" = $1  [["client_id", 2]]

    def create_client_obj
      return if errors.any?
      @contact = ClientContact.new(params)
      @contact.save
      @errors << fill_errors(@contact) if @contact.errors.any?
---
INSERT INTO "client_contacts" ("first_name", "last_name", "email", "phone", "position", "client_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

    def validate_client
      @client = Client.where(id: params[:client_id], active: true).last
---
SELECT  "clients".* FROM "clients" WHERE "clients"."id" = $1 AND "clients"."active" = $2 ORDER BY "clients"."id" DESC LIMIT $3  [["id", 2], ["active", true], ["LIMIT", 1]]

    def find_contact
      @contact = ClientContact.find_by_id(params[:id])
---
SELECT  "client_contacts".* FROM "client_contacts" WHERE "client_contacts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]