app/services/clients/service.rb

SELECT "clients".* FROM "clients" WHERE "clients"."active" = $1  [["active", true]]
---
    def client_list
      @clients = Client.where(active: true)

SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
---
    def validate_city
      return if errors.any?
      city = City.find_by_id(params[:city_id])

SELECT  "currencies".* FROM "currencies" WHERE "currencies"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def validate_currency
      return if errors.any?
      currency = Currency.find_by_id(params[:currency_id])

SELECT  "user_accounts".* FROM "user_accounts" WHERE "user_accounts"."id" = $1 LIMIT $2  [["id", 64], ["LIMIT", 1]]
---
    def validate_user_account
      return if errors.any?
      user_account = UserAccount.find_by_id(params[:user_account_id])

SELECT  "clients_types".* FROM "clients_types" WHERE "clients_types"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def validate_clients_type
      return if errors.any?
      type = ClientsType.find_by_id(params[:clients_type_id])