app/services/clients/service.rb

SELECT "clients_types".* FROM "clients_types"
---
    def get_types
      @types = ClientsType.all

UPDATE "clients" SET "active" = $1, "updated_at" = $2 WHERE "clients"."id" = $3  [["active", false], ["updated_at", "2020-11-22 00:43:42.774657"], ["id", 1]]
---
    def delete_client
      find_client
      return if @errors.any?
      @client.active = false
      @client.save

SELECT  "countries".* FROM "countries" WHERE "countries"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
    def validate_country
      country = Country.find_by_id(params[:country_id])

SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
---
    def validate_city
      return if errors.any?
      city = City.find_by_id(params[:city_id])

SELECT  "currencies".* FROM "currencies" WHERE "currencies"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
    def validate_currency
      return if errors.any?
      currency = Currency.find_by_id(params[:currency_id])

SELECT  "user_accounts".* FROM "user_accounts" WHERE "user_accounts"."id" = $1 LIMIT $2  [["id", 56], ["LIMIT", 1]]
---
    def validate_user_account
      return if errors.any?
      user_account = UserAccount.find_by_id(params[:user_account_id])

SELECT  "clients_groups".* FROM "clients_groups" WHERE "clients_groups"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def validate_clients_group
      return if errors.any?
      group = ClientsGroup.find_by_id(params[:clients_group_id])

SELECT  "clients_types".* FROM "clients_types" WHERE "clients_types"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def validate_clients_type
      return if errors.any?
      type = ClientsType.find_by_id(params[:clients_type_id])

INSERT INTO "clients" ("name", "address", "vat_number", "user_account_id", "country_id", "city_id", "clients_group_id", "clients_type_id", "currency_id", "phone", "web_address", "kunde_nr", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14) RETURNING "id"
INSERT INTO "clients" ("name", "address", "user_account_id", "country_id", "city_id", "clients_group_id", "clients_type_id", "currency_id", "phone", "web_address", "kunde_nr", "created_at", "updated_at", "product_vat_type_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14) RETURNING "id"
---
    def create_client_obj
      return if errors.any?
      @client = Client.new(params)
      @client.active = true
      @client.save
      @errors << fill_errors(@client) if @client.errors.any?

UPDATE "clients" SET "name" = $1, "address" = $2, "vat_number" = $3, "phone" = $4, "web_address" = $5, "kunde_nr" = $6, "updated_at" = $7 WHERE "clients"."id" = $8  [["name", "buka"], ["address", "buka"], ["vat_number", "buka"], ["phone", "buka"], ["web_address", "buka"], ["kunde_nr", "buka"], ["updated_at", "2020-11-22 00:25:31.518006"], ["id", 2]]
---
    def update_client_obj
      find_client
      @client.update(params)

SELECT  "clients".* FROM "clients" WHERE "clients"."id" = $1 AND "clients"."active" = $2 ORDER BY "clients"."id" DESC LIMIT $3  [["id", 3], ["active", true], ["LIMIT", 1]]
---
    def find_client
      @client = Client.where(id: params[:id], active: true).last