app/services/owners/company_services.rb

SELECT "companies".* FROM "companies"
---
    def company_list
      @companies = Company.all

SELECT  "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
---
    def find_company
      @company = Company.find_by_id(@params[:company_id])