app/services/owners/dashboard.rb

    def get_companies(type)
      Company.where(active: type).count
---
SELECT COUNT(*) FROM "companies" WHERE "companies"."active" = $1  [["active", true]]

    def get_user(role)
      UserAccount.joins(user_role: :role_group).where(role_groups: { id_name: role}, active: true).count
---
SELECT COUNT(*) FROM "user_accounts" INNER JOIN "user_roles" ON "user_roles"."user_account_id" = "user_accounts"."id" INNER JOIN "role_groups" ON "role_groups"."id" = "user_roles"."role_group_id" WHERE "role_groups"."id_name" = $1 AND "user_accounts"."active" = $2  [["id_name", "project_manager"], ["active", true]]

    def user_total(roles)
      UserAccount.joins(user_role: :role_group).where(role_groups: { id_name: roles}, active: true).count
---
SELECT COUNT(*) FROM "user_accounts" INNER JOIN "user_roles" ON "user_roles"."user_account_id" = "user_accounts"."id" INNER JOIN "role_groups" ON "role_groups"."id" = "user_roles"."role_group_id" WHERE "role_groups"."id_name" IN ($1, $2, $3) AND "user_accounts"."active" = $4  [["id_name", "project_manager"], ["id_name", "employee"], ["id_name", "super_admin"], ["active", true]]

    def get_resource(type)
      Resource.joins(:resource_type).where(resource_types: { id_name: type}).count
---
SELECT COUNT(*) FROM "resources" INNER JOIN "resource_types" ON "resource_types"."id" = "resources"."resource_type_id" WHERE "resource_types"."id_name" = $1  [["id_name", "machine"]]

    def total_resources
      Resource.count
---
SELECT COUNT(*) FROM "resources"

    def get_tasks(status)
      Task.joins(:task_status, project: :user_account).where(task_statuses: { id_name: status}).count
---
SELECT COUNT(*) FROM "tasks" INNER JOIN "task_statuses" ON "task_statuses"."id" = "tasks"."task_status_id" INNER JOIN "projects" ON "projects"."id" = "tasks"."project_id" INNER JOIN "user_accounts" ON "user_accounts"."id" = "projects"."user_account_id" WHERE "task_statuses"."id_name" = $1  [["id_name", "done"]]

    def total_tasks
      Task.joins(:task_status, project: :user_account).count
---
SELECT COUNT(*) FROM "tasks" INNER JOIN "task_statuses" ON "task_statuses"."id" = "tasks"."task_status_id" INNER JOIN "projects" ON "projects"."id" = "tasks"."project_id" INNER JOIN "user_accounts" ON "user_accounts"."id" = "projects"."user_account_id"

    def get_finished
      Project.joins(:user_account).where('deadline < ?', DateTime.now).count
---
SELECT COUNT(*) FROM "projects" INNER JOIN "user_accounts" ON "user_accounts"."id" = "projects"."user_account_id" WHERE (deadline < '2021-06-13 10:05:17.141872')

    def get_current
      Project.joins(:user_account).where('start_date < ? AND deadline > ?', DateTime.now, DateTime.now).count
---
SELECT COUNT(*) FROM "projects" INNER JOIN "user_accounts" ON "user_accounts"."id" = "projects"."user_account_id" WHERE (start_date < '2021-06-13 10:05:17.169276' AND deadline > '2021-06-13 10:05:17.169293')

    def get_scheduled
      Project.joins(:user_account).where('start_date > ?', DateTime.now).count
---
SELECT COUNT(*) FROM "projects" INNER JOIN "user_accounts" ON "user_accounts"."id" = "projects"."user_account_id" WHERE (start_date > '2021-06-13 10:05:17.170856')

    def total
      Project.joins(:user_account).count
---
SELECT COUNT(*) FROM "projects" INNER JOIN "user_accounts" ON "user_accounts"."id" = "projects"."user_account_id"