app/services/scheduler/services.rb

SELECT user_accounts.id, first_name, last_name FROM "user_accounts" INNER JOIN "user_roles" ON "user_roles"."user_account_id" = "user_accounts"."id" INNER JOIN "role_groups" ON "role_groups"."id" = "user_roles"."role_group_id" WHERE "user_accounts"."company_id" = $1 AND "role_groups"."id_name" = $2  [["company_id", 15], ["id_name", "project_manager"]]
---
    def get_users
      UserAccount
          .select('user_accounts.id, first_name, last_name')
          .joins(user_role: :role_group)
          .where(company_id: @current_user.company_id, role_groups: { id_name: @params[:type]})
          .as_json

SELECT id, name FROM "resources" WHERE "resources"."company_id" = $1  [["company_id", 15]]
---
    def get_resources
      Resource.select('id, name').where(company_id: @current_user.company_id).as_json