app/services/scheduler/services.rb

    def get_users
      UserAccount.select('id, first_name, last_name').where(company_id: @current_user.company_id).as_json
---
SELECT id, first_name, last_name FROM "user_accounts" WHERE "user_accounts"."company_id" = $1  [["company_id", 15]]