app/services/dashboard/services.rb

    def get_user(role)
      UserAccount.joins(user_role: :role_group).where(role_groups: { id_name: role}, company_id: @current_user.company_id).count
---
SELECT COUNT(*) FROM "user_accounts" INNER JOIN "user_roles" ON "user_roles"."user_account_id" = "user_accounts"."id" INNER JOIN "role_groups" ON "role_groups"."id" = "user_roles"."role_group_id" WHERE "role_groups"."id_name" = $1 AND "user_accounts"."company_id" = $2  [["id_name", "project_manager"], ["company_id", 15]]

    def user_total(roles)
      UserAccount.joins(user_role: :role_group).where(role_groups: { id_name: roles}, company_id: @current_user.company_id).count
---
SELECT COUNT(*) FROM "user_accounts" INNER JOIN "user_roles" ON "user_roles"."user_account_id" = "user_accounts"."id" INNER JOIN "role_groups" ON "role_groups"."id" = "user_roles"."role_group_id" WHERE "role_groups"."id_name" IN ($1, $2) AND "user_accounts"."company_id" = $3  [["id_name", "project_manager"], ["id_name", "employee"], ["company_id", 15]]

    def get_resource(type)
      Resource.joins(:resource_type).where(resource_types: { id_name: type}, company_id: @current_user.company_id).count
---
SELECT COUNT(*) FROM "resources" INNER JOIN "resource_types" ON "resource_types"."id" = "resources"."resource_type_id" WHERE "resource_types"."id_name" = $1 AND "resources"."company_id" = $2  [["id_name", "machine"], ["company_id", 15]]

    def total_resources
      Resource.where(company_id: @current_user.company_id).count
---
SELECT COUNT(*) FROM "resources" WHERE "resources"."company_id" = $1  [["company_id", 15]]

    def get_tasks(status)
      Task.joins(:task_status, project: :user_account).where(user_accounts: { company_id: @current_user.company_id}, task_statuses: { id_name: status}).count
---
SELECT COUNT(*) FROM "tasks" INNER JOIN "task_statuses" ON "task_statuses"."id" = "tasks"."task_status_id" INNER JOIN "projects" ON "projects"."id" = "tasks"."project_id" INNER JOIN "user_accounts" ON "user_accounts"."id" = "projects"."user_account_id" WHERE "user_accounts"."company_id" = $1 AND "task_statuses"."id_name" = $2  [["company_id", 15], ["id_name", "done"]]

    def total_tasks
      Task.joins(:task_status, project: :user_account).where(user_accounts: { company_id: @current_user.company_id}).count
---
SELECT COUNT(*) FROM "tasks" INNER JOIN "task_statuses" ON "task_statuses"."id" = "tasks"."task_status_id" INNER JOIN "projects" ON "projects"."id" = "tasks"."project_id" INNER JOIN "user_accounts" ON "user_accounts"."id" = "projects"."user_account_id" WHERE "user_accounts"."company_id" = $1  [["company_id", 15]]

    def get_finished
      Project.joins(:user_account).where(user_accounts: { company_id: @current_user.company_id}).where('deadline < ?', DateTime.now).count
---
SELECT COUNT(*) FROM "projects" INNER JOIN "user_accounts" ON "user_accounts"."id" = "projects"."user_account_id" WHERE "user_accounts"."company_id" = $1 AND (deadline < '2021-05-22 12:32:39.705405')  [["company_id", 15]]

    def get_current
      Project.joins(:user_account).where(user_accounts: { company_id: @current_user.company_id}).where('start_date < ? AND deadline > ?', DateTime.now, DateTime.now).count
---
SELECT COUNT(*) FROM "projects" INNER JOIN "user_accounts" ON "user_accounts"."id" = "projects"."user_account_id" WHERE "user_accounts"."company_id" = $1 AND (start_date < '2021-05-22 12:32:39.711974' AND deadline > '2021-05-22 12:32:39.711998')  [["company_id", 15]]

    def get_scheduled
      Project.joins(:user_account).where(user_accounts: { company_id: @current_user.company_id}).where('start_date > ?', DateTime.now).count
---
SELECT COUNT(*) FROM "projects" INNER JOIN "user_accounts" ON "user_accounts"."id" = "projects"."user_account_id" WHERE "user_accounts"."company_id" = $1 AND (start_date > '2021-05-22 12:32:39.714553')  [["company_id", 15]]

    def total
      Project.joins(:user_account).where(user_accounts: { company_id: @current_user.company_id}).count
---
SELECT COUNT(*) FROM "projects" INNER JOIN "user_accounts" ON "user_accounts"."id" = "projects"."user_account_id" WHERE "user_accounts"."company_id" = $1  [["company_id", 15]]