app/services/settings/country_and_city_service.rb

    def country
      @country = Country.where(country_code: params[:country_code]).first_or_initialize
      @country.update(name: params[:name])
      errors.concat(@country.errors.to_a) if @country.errors.any?
---
SELECT  "countries".* FROM "countries" WHERE "countries"."country_code" = $1 ORDER BY "countries"."id" ASC LIMIT $2  [["country_code", "geo"], ["LIMIT", 1]]
UPDATE "countries" SET "name" = $1 WHERE "countries"."id" = $2  [["name", "Georgiaaa"], ["id", 1]]
SELECT "countries".* FROM "countries"

    def city
      @city = City.where(city_code: params[:city_code]).first_or_initialize
      @city.update(name: params[:name], country_id: params[:country_id])
      errors.concat(@city.errors.to_a) if @city.errors.any?
---
SELECT "cities".* FROM "cities" WHERE "cities"."country_id" = $1  [["country_id", 1]]