app/services/settings/country_and_city_service.rb

    def country
      @country = Country.where(country_code: params[:country_code]).first_or_initialize
---
SELECT  "countries".* FROM "countries" WHERE "countries"."country_code" = $1 ORDER BY "countries"."id" ASC LIMIT $2  [["country_code", "GEO"], ["LIMIT", 1]]

    def city
      @city = City.where(city_code: params[:city_code]).first_or_initialize
---
SELECT  "cities".* FROM "cities" WHERE "cities"."city_code" = $1 ORDER BY "cities"."id" ASC LIMIT $2  [["city_code", "TBL"], ["LIMIT", 1]]

    def destroy_country
      @country = Country.find(params[:id])
      @country.destroy
      @errors << fill_errors(@country) if @country.errors.any?
---
SELECT  "countries".* FROM "countries" WHERE "countries"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "countries" WHERE "countries"."id" = $1  [["id", 1]]
SELECT  "countries".* FROM "countries" WHERE "countries"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

    def destroy_city
      @city = City.find(params[:id])
      @city.destroy
---
SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "cities" WHERE "cities"."id" = $1  [["id", 7]]