app/services/settings/models_service.rb

    def machine_model
      @machine = MachineModel.where(id_name: @id_name).first_or_initialize
      @machine.update(name: params[:name])
      errors.concat(@machine.errors.to_a) if @machine.errors.any?
---
SELECT "machine_models".* FROM "machine_models"