app/services/settings/models_service.rb

SELECT  "machine_models".* FROM "machine_models" WHERE "machine_models"."id_name" = $1 ORDER BY "machine_models"."id" ASC LIMIT $2  [["id_name", "bmw"], ["LIMIT", 1]]
SELECT "machine_models".* FROM "machine_models" WHERE "machine_models"."company_id" = $1  [["company_id", 15]]
SELECT "tool_models".* FROM "tool_models"
---
    def machine_model
      @machine = MachineModel.where(id_name: @id_name).first_or_initialize
      @machine.company_id = @current_account.company_id
      @machine.update(name: params[:name])
      errors.concat(@machine.errors.to_a) if @machine.errors.any?

SELECT  "tool_models".* FROM "tool_models" WHERE "tool_models"."id_name" = $1 ORDER BY "tool_models"."id" ASC LIMIT $2  [["id_name", "cat"], ["LIMIT", 1]]
---
    def tool_model
      @tool = ToolModel.where(id_name: @id_name).first_or_initialize

SELECT  "external_resource_types".* FROM "external_resource_types" WHERE "external_resource_types"."id_name" = $1 ORDER BY "external_resource_types"."id" ASC LIMIT $2  [["id_name", "bosh"], ["LIMIT", 1]]
---
    def source_type
      @external = ExternalResourceType.where(id_name: @id_name).first_or_initialize

SELECT  "machine_models".* FROM "machine_models" WHERE "machine_models"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "machine_models" WHERE "machine_models"."id" = $1  [["id", 1]]
---
    def destroy_machine_model
      @machine = MachineModel.find(params[:id])
      @machine.destroy

SELECT  "external_resource_types".* FROM "external_resource_types" WHERE "external_resource_types"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "external_resource_types" WHERE "external_resource_types"."id" = $1  [["id", 1]]
---
    def destroy_external_source_type
      @external = ExternalResourceType.find(params[:id])
      @external.destroy

SELECT  "tool_models".* FROM "tool_models" WHERE "tool_models"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "tool_models" WHERE "tool_models"."id" = $1  [["id", 2]]
---
    def destroy_tool_model
      @tool = ToolModel.find(params[:id])
      @tool.destroy