app/services/auth/locking_management_service.rb

SELECT  "user_accounts".* FROM "user_accounts" WHERE ("user_accounts"."username" = $1 OR "user_accounts"."phone_number" = $2) AND "user_accounts"."active" = $3 ORDER BY "user_accounts"."id" ASC LIMIT $4  [["username", "bukabuka"], ["phone_number", "bukabuka"], ["active", true], ["LIMIT", 1]]
---
    def initialize(authenticated_user, user_name = nil, user_by_name = nil)
      @authenticated_user = authenticated_user
      @user_name = user_name
      @user_by_name = user_by_name || UserAccount.where(username: user_name).or(UserAccount.where(phone_number: user_name)).where(active: true).first

SELECT  "locking_types".* FROM "locking_types" WHERE "locking_types"."id_name" = $1 LIMIT $2  [["id_name", "password_error_limited"], ["LIMIT", 1]]
---
    def locked_user_error_message

      locker_type_id = LockingType.find_by_id_name(:password_error_limited).try(:id)

SELECT  "locking_types".* FROM "locking_types" WHERE "locking_types"."id_name" = $1 LIMIT $2  [["id_name", "password_error_limited"], ["LIMIT", 1]]
---
    def locked_by_invalid_pass?
      locker_type_id = LockingType.find_by_id_name(:password_error_limited).try(:id)