app/services/auth/service.rb

    def find_user_with_credentials(auth_params)
      user = UserAccount.where(username: auth_params[:username]).first
---
SELECT  "user_accounts".* FROM "user_accounts" WHERE "user_accounts"."username" = $1 ORDER BY "user_accounts"."id" ASC LIMIT $2  [["username", "bukabuka"], ["LIMIT", 1]]