app/services/category_sub_categories/categories_service.rb

    def create_category
      @category = Category.new(@category_params)
      @category.id_name = @category_params[:name]["en"].downcase.parameterize(separator: '_')
      @category.save

      @errors << fill_errors(@category) if @category.errors.any?
---
SELECT "categories".* FROM "categories"

    def update_category
      find_category
      return if errors.any?
      @category.assign_attributes(@category_params)
      @category.save
---
UPDATE "categories" SET "name" = $1 WHERE "categories"."id" = $2  [["name", "{\"en\":\"buka\"}"], ["id", 1]]

    def category_list
      @category = Category.all
      fill_custom_errors(self, :base, :not_found, I18n.t("custom.errors.data_not_found")) if @category.empty?
---
SELECT  1 AS one FROM "categories" LIMIT $1  [["LIMIT", 1]]

    def find_category
      @category = Category.find_by_id(@category_params[:id])
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def validate_category
      return if errors.any?
      fill_custom_errors(self, :base,:invalid, I18n.t("custom.validation.category_validation")) if SubCategory.where(category_id: @category.id).present?
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]