app/services/category_sub_categories/sub_categories_service.rb

    def create_sub_category
      @sub_category = SubCategory.new(@sub_category_params)
      @sub_category.save

      @errors << fill_errors(@sub_category) if @sub_category.errors.any?
---
SELECT "sub_categories".* FROM "sub_categories" WHERE "sub_categories"."category_id" = $1  [["category_id", 1]]