app/services/orders/comments_service.rb

INSERT INTO "order_comments" ("order_id", "user_account_id", "comment", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["order_id", 6], ["user_account_id", 64], ["comment", "yleo shena"], ["created_at", "2020-12-13 14:17:01.952059"], ["updated_at", "2020-12-13 14:17:01.952059"]]
SELECT "order_comments".* FROM "order_comments" WHERE "order_comments"."order_id" = $1  [["order_id", 6]]
---
    def create_comment
      @comment = OrderComment.new(params)
      @comment.save
      @errors << fill_errors(@comment) if @comment.errors.any?