app/services/orders/orders_services.rb

SELECT  "order_statuses".* FROM "order_statuses" WHERE "order_statuses"."id_name" = $1 LIMIT $2  [["id_name", "open"], ["LIMIT", 1]]
---
    def claim_order
      status_id = OrderStatus.find_by_id_name(claimed).id