app/services/orders/orders_services.rb

SELECT  "order_statuses".* FROM "order_statuses" WHERE "order_statuses"."id_name" = $1 LIMIT $2  [["id_name", "open"], ["LIMIT", 1]]
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "orders" SET "user_account_id" = $1, "updated_at" = $2 WHERE "orders"."id" = $3  [["user_account_id", 64], ["updated_at", "2020-12-06 15:30:42.070002"], ["id", 6]]
INSERT INTO "orders" ("title", "description", "client_id", "order_type_id", "order_status_id", "user_account_id", "start_time", "deadline", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
    def claim_order
      status_id = OrderStatus.find_by_id_name(claimed).id
      @order = Order.find(params[:order_id])
      @order.update(user_account_id: params[:user_account_id], order_status_id: status_id)
      @errors << fill_errors(@order) if @order.errors.any?

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
    def get_order
      Order.find(params[:id]).title

SELECT "orders"."user_account_id" FROM "orders" WHERE "orders"."id" = $1  [["id", 6]]
SELECT "tasks"."product_id" FROM "tasks" WHERE "tasks"."order_id" = $1  [["order_id", 6]]
---
    def order_members
      order_ids = Order.select(:user_account_id).where(id: params[:id]).pluck(:user_account_id)
      tasks_ids = Task.select(:user_account_id).where(order_id: params[:id]).pluck(:product_id)

SELECT "order_products"."product_id" FROM "order_products" WHERE "order_products"."order_id" = $1  [["order_id", 6]]
SELECT "tasks"."product_id" FROM "tasks" WHERE "tasks"."order_id" = $1  [["order_id", 6]]
SELECT "product_prices".* FROM "product_prices" WHERE "product_prices"."product_id" IN ($1, $2)  [["product_id", 15], ["product_id", 15]]
SELECT  "supplier_products".* FROM "supplier_products" WHERE "supplier_products"."product_id" = $1 LIMIT $2  [["product_id", 15], ["LIMIT", 1]]
SELECT "product_prices".* FROM "product_prices" WHERE "product_prices"."product_id" IN ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15)
---
    def order_price
      order_price = 0
      order_ids = OrderProduct.select(:product_id).where(order_id: params[:id]).pluck(:product_id)
      tasks_ids = Task.select(:product_id).where(order_id: params[:id]).pluck(:product_id)
      product_ids = order_ids + tasks_ids
      ProductPrice.where(product_id: product_ids).each do |x|
        cost_price = x.list_price_amount + SupplierProduct.find_by_product_id(x.product_id)&.supplier_product_price.to_i

SELECT "tasks".* FROM "tasks" WHERE "tasks"."order_id" = $1  [["order_id", 6]]
---
    def worked_hours
      sum = 0
      Task.where(order_id: params[:id]).each do |x|

SELECT COUNT(*) FROM "tasks" WHERE "tasks"."order_id" = $1 AND "tasks"."task_status_id" = $2  [["order_id", 6], ["task_status_id", 3]]
---
    def percentage_of_tasks
      {
          open: Task.where(order_id: params[:id], task_status_id: 1).size,
          in_progress: Task.where(order_id: params[:id], task_status_id: 2).size,
          done: Task.where(order_id: params[:id], task_status_id: 3).size,
          total: Task.where(order_id: params[:id]).size

SELECT  "clients".* FROM "clients" WHERE "clients"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def validate_client
      @client = Client.where(id: params[:client_id], active: true).last

SELECT  "order_types".* FROM "order_types" WHERE "order_types"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def validate_order_type
      return if errors.any?
      type = OrderType.find_by_id(params[:order_type_id])

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
    def find_order
      @order = Order.find_by_id(params[:id])