app/services/orders/order_products_services.rb

    def order_products_list
      @order_products = OrderProduct.where(order_id: params[:id])
---
SELECT "order_products".* FROM "order_products" WHERE "order_products"."order_id" IS NULL

    def delete_order_prod
      find_order_product
      return if @errors.any?
      @order_product.destroy
---
DELETE FROM "order_products" WHERE "order_products"."id" = $1  [["id", 2]]

    def validate_product
      product = Product.find_by(id: params[:product_id])
---
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]

    def validate_order
      order = Order.find_by(id: params[:order_id])
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]

    def create_order_product_obj
      return if errors.any?
      @order_product = OrderProduct.new(params)
      @order_product.save
---
INSERT INTO "order_products" ("product_id", "order_id", "count") VALUES ($1, $2, $3) RETURNING "id"  [["product_id", 13], ["order_id", 6], ["count", 2]]

    def update_order_product
      find_order_product
      @order_product.update(params)
      @errors << fill_errors(@order_product) if @order_product.errors.any?
---
UPDATE "order_products" SET "count" = $1 WHERE "order_products"."id" = $2  [["count", 99], ["id", 2]]
INSERT INTO "order_products" ("product_id", "order_id", "count") VALUES ($1, $2, $3) RETURNING "id"  [["product_id", 15], ["order_id", 6], ["count", 23]]

    def find_order_product
      @order_product = OrderProduct.find_by_id(params[:id])
---
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
SELECT  "order_products".* FROM "order_products" WHERE "order_products"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]