app/services/general/currencies_service.rb

SELECT "currencies".* FROM "currencies"
---
    def list
      @currencies = Currency.all