app/services/roles/role_management_service.rb

    def find_role
      @role_group = RoleGroup.find_by_id(params[:id])
---
SELECT  "role_groups".* FROM "role_groups" WHERE "role_groups"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]