app/services/roles/role_management_service.rb

INSERT INTO "role_groups" ("name", "id_name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "new_role"], ["id_name", "new_role"], ["created_at", "2020-10-14 11:49:53.611191"], ["updated_at", "2020-10-14 11:49:53.611191"]]
SELECT "role_groups".* FROM "role_groups"
---
    def create_role
      @role_group = RoleGroup.new(@params)
      @role_group.id_name = @params[:name].downcase.parameterize(separator: '_')
      @role_group.save
      @errors << fill_errors(@role_group) if @role_group.errors.any?

UPDATE "role_groups" SET "name" = $1, "updated_at" = $2 WHERE "role_groups"."id" = $3  [["name", "new role"], ["updated_at", "2020-10-14 11:51:30.886709"], ["id", 5]]
INSERT INTO "role_groups" ("name", "id_name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "new_test"], ["id_name", "new_test"], ["created_at", "2020-10-17 15:22:13.358369"], ["updated_at", "2020-10-17 15:22:13.358369"]]
---
    def update
      find_role
      return if errors.any?
      @role_group.assign_attributes(params)
      @role_group.save

      @errors << fill_errors(@role_group) if @role_group.errors.any?

SELECT "user_roles".* FROM "user_roles" WHERE "user_roles"."role_group_id" = $1  [["role_group_id", 4]]
---
    def validate_destroy!
      return if errors.any?
      if UserRole.where(role_group_id: @role_group.id).present?

DELETE FROM "role_groups" WHERE "role_groups"."id" = $1  [["id", 4]]
---
    def destroy_role_group
      return if errors.any?
      @role_group.destroy

SELECT  "role_groups".* FROM "role_groups" WHERE "role_groups"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
    def find_role
      @role_group = RoleGroup.find(params[:id])