lib/methods_service.rb

  def current_account
    return nil unless request.headers['Authorization']
    user_id = get_user_id
    @current_account ||= UserAccount.find(user_id)
---
SELECT  "user_accounts".* FROM "user_accounts" WHERE "user_accounts"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]