app/services/tasks/services.rb

    def user_task_list
      tasks = Task.joins(project: [user_account: :company]).where(companies: {id: @current_company.id})
      tasks = tasks.where(user_accounts: {id: @current_user.id}) if project_manager?
      @builded_object = []

      tasks.all.each do |task|
---
SELECT "tasks".* FROM "tasks" INNER JOIN "projects" ON "projects"."id" = "tasks"."project_id" INNER JOIN "user_accounts" ON "user_accounts"."id" = "projects"."user_account_id" INNER JOIN "companies" ON "companies"."id" = "user_accounts"."company_id" WHERE "companies"."id" = $1  [["id", 15]]

    def progress
      find_status
      find_task
      return if errors.any?
      @task.update(task_status_id: @status.id)
---
UPDATE "tasks" SET "title" = $1, "tracked_time" = $2, "updated_at" = $3 WHERE "tasks"."id" = $4  [["title", "updated name"], ["tracked_time", "8"], ["updated_at", "2020-11-29 00:00:26.607046"], ["id", 2]]

    def delete_task
      find_task
      return if @errors.any?
      ActiveRecord::Base.transaction do
        user_tasks = UserAccountTask.where(task_id: @task.id)
        resource_tasks = TaskResource.where(task_id: @task.id)
        user_tasks.delete_all if user_tasks
        resource_tasks.delete_all if resource_tasks
        @task.destroy
      end

      @errors << fill_errors(@task) if @task.errors.any?
---
DELETE FROM "user_account_tasks" WHERE "user_account_tasks"."id" = $1  [["id", 6]]
INSERT INTO "task_resources" ("resource_id", "task_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["resource_id", 3], ["task_id", 7], ["created_at", "2021-04-17 23:15:51.951849"], ["updated_at", "2021-04-17 23:15:51.951849"]]
INSERT INTO "user_account_tasks" ("user_account_id", "task_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_account_id", 9], ["task_id", 7], ["created_at", "2021-04-17 23:15:51.948844"], ["updated_at", "2021-04-17 23:15:51.948844"]]
SELECT  "resources".* FROM "resources" WHERE "resources"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "user_account_tasks".* FROM "user_account_tasks" WHERE "user_account_tasks"."task_id" = $1 AND "user_account_tasks"."id" IN ($2, $3)  [["task_id", 7], ["id", 7], ["id", 6]]

    def find_status
      @status = TaskStatus.find_by(id_name: params[:id_name])
---
SELECT  "task_statuses".* FROM "task_statuses" WHERE "task_statuses"."id_name" = $1 LIMIT $2  [["id_name", "open"], ["LIMIT", 1]]

    def update_task_obj
      @task.update(params)
      @errors << fill_errors(@task) if @task.errors.any?
---
INSERT INTO "tasks" ("title", "description", "task_status_id", "start_time", "deadline", "created_at", "updated_at", "project_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"