app/services/tasks/services.rb

    def task_list
      @builded_object = []
      Task.where(project_id: params["id"]).each do |task|
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."project_id" = $1  [["project_id", 5]]

    def user_task_list
      @builded_object = []
      #After Roles here we will ad if else statment for fifferent role, Admin, manager, employ
      Task.all.each do |task|
---
SELECT "tasks".* FROM "tasks"

    def get_users(task)
      UserAccount
          .select('user_accounts.id, first_name, last_name')
          .joins(user_account_tasks: :task)
          .where(tasks: {id: task.id })
          .group('user_accounts.id').as_json
---
SELECT user_accounts.id, first_name, last_name FROM "user_accounts" INNER JOIN "user_account_tasks" ON "user_account_tasks"."user_account_id" = "user_accounts"."id" INNER JOIN "tasks" ON "tasks"."id" = "user_account_tasks"."task_id" WHERE "tasks"."id" = $1 GROUP BY user_accounts.id  [["id", 3]]

    def get_resources(task)
      Resource.select('resources.id, name').joins(task_resources: :task).where(tasks: {id: task.id }).group('resources.id').as_json
---
SELECT resources.id, name FROM "resources" INNER JOIN "task_resources" ON "task_resources"."resource_id" = "resources"."id" INNER JOIN "tasks" ON "tasks"."id" = "task_resources"."task_id" WHERE "tasks"."id" = $1 GROUP BY resources.id  [["id", 3]]

    def progress
      find_status
      find_task
      return if errors.any?
      @task.update(task_status_id: @status.id)
---
UPDATE "tasks" SET "task_status_id" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["task_status_id", 7], ["updated_at", "2021-04-13 21:14:35.411975"], ["id", 3]]

    def delete_task
      find_task
      return if @errors.any?
      @task.destroy
      @errors << fill_errors(@task) if @task.errors.any?
---
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 7]]
INSERT INTO "tasks" ("title", "description", "task_status_id", "start_time", "deadline", "created_at", "updated_at", "project_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

    def find_status
      @status = TaskStatus.find_by(id_name: params[:id_name])
---
SELECT  "task_statuses".* FROM "task_statuses" WHERE "task_statuses"."id_name" = $1 LIMIT $2  [["id_name", "open"], ["LIMIT", 1]]

    def find_task
      return if errors.any?
      @task = Task.find(params[:id])
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

    def validate_order
      @order = Order.find_by(id: params[:order_id])
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]

    def validate_user_account
      return if errors.any?
      user_account = UserAccount.find_by_id(params[:user_account_id])
---
SELECT  "user_accounts".* FROM "user_accounts" WHERE "user_accounts"."id" = $1 LIMIT $2  [["id", 92], ["LIMIT", 1]]

    def validate_product
      return if errors.any?
      product = Product.find_by_id(params[:product_id])
---
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]

    def create_task_obj
      return if errors.any?
      @task = Task.new(params)
      @task.task_status_id = @status&.id
      @task.save
      @errors << fill_errors(@task) if @task.errors.any?
---
INSERT INTO "tasks" ("title", "description", "task_status_id", "start_time", "deadline", "created_at", "updated_at", "project_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

    def default_status
      @status = TaskStatus.find_by(id_name: :open)
---
SELECT  "task_statuses".* FROM "task_statuses" WHERE "task_statuses"."id_name" = $1 LIMIT $2  [["id_name", "open"], ["LIMIT", 1]]

    def update_task_obj
      @task.update(params)
---
UPDATE "tasks" SET "title" = $1, "description" = $2, "start_time" = $3, "deadline" = $4, "updated_at" = $5 WHERE "tasks"."id" = $6  [["title", "updated string"], ["description", "updated string"], ["start_time", "2021-12-11 00:00:00"], ["deadline", "2023-12-11 00:00:00"], ["updated_at", "2021-04-17 23:15:51.946232"], ["id", 7]]