app/services/tasks/services.rb

INSERT INTO "task_resources" ("resource_id", "task_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["resource_id", 9], ["task_id", 8], ["created_at", "2021-04-25 16:12:30.496392"], ["updated_at", "2021-04-25 16:12:30.496392"]]
INSERT INTO "tasks" ("title", "description", "task_status_id", "start_time", "deadline", "created_at", "updated_at", "project_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
INSERT INTO "user_account_tasks" ("user_account_id", "task_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_account_id", 93], ["task_id", 8], ["created_at", "2021-04-25 16:12:30.493852"], ["updated_at", "2021-04-25 16:12:30.493852"]]
SELECT  "resources".* FROM "resources" WHERE "resources"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
---
    def delete_task
      find_task
      return if @errors.any?
      ActiveRecord::Base.transaction do
        user_tasks = UserAccountTask.where(task_id: @task.id)
        resource_tasks = TaskResource.where(task_id: @task.id)
        user_tasks.delete_all if user_tasks
        resource_tasks.delete_all if resource_tasks
        @task.destroy
      end

      @errors << fill_errors(@task) if @task.errors.any?

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
    def validate_project_dates
      return if errors.any?
      @project = Project.find(@params[:project_id])

SELECT  "user_accounts".* FROM "user_accounts" WHERE "user_accounts"."id" = $1 LIMIT $2  [["id", 94], ["LIMIT", 1]]
---
    def validate_user_account
      return if errors.any?
      user_account = UserAccount.find_by_id(params[:user_account_id])