app/services/resources/attachments_service.rb

    def find_details_by_uuid
      @file = Attachment.find_by(uuid: @file_params[:uuid])
      fill_custom_errors(self, :base, :not_found, I18n.t("custom.errors.data_not_found")) unless @file.present?
---
SELECT "attachments".* FROM "attachments"