app/services/resources/attachments_service.rb

INSERT INTO "attachments" ("attached_on_type", "attached_on_id", "file", "uuid", "exp_date") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["attached_on_type", "Resource"], ["attached_on_id", 10], ["file", "Screenshot_from_2019-10-04_10-47-41.png"], ["uuid", "f181663e-710c-4126-bc8d-07f7e64db0a0"], ["exp_date", "2023-12-23 00:00:00"]]
SELECT id, pol_type, type_on, name, file as file_name, uuid FROM "attachments" JOIN (SELECT id as obj_id, 'Resource' as pol_type, model_on_type as type_on, name FROM "resources" UNION SELECT id as obj_id, 'UserAccount' as pol_type, 'customer' as type_on, concat(first_name, ' ', last_name) as name FROM "user_accounts") attached_obj ON attached_obj.id = attachments.attached_on_id AND attached_obj.pol_type = attachments.attached_on_type
---
    def create_file
      @file = Attachment.new(@file_params)
      @file.save
      @errors << fill_errors(@file) if @file.errors.any?

SELECT "resources".* FROM "resources"
SELECT id as obj_id, 'Resource' as pol_type, model_on_type as type_on, name FROM "resources" WHERE ("model_on_type = :model_type_on", model_type_on: @file_params[:model_on_type])
---
    def files
      resource = get_resource
      user = get_user
      project = get_project

      base_query = ""
      base_query += "attached_on_type = :attached_type" if @file_params[:attached_on_type]
      base_query += " AND attached_on_id = :attached_id" if @file_params[:attached_on_id]

      @files = Attachment
                   .select('id, pol_type, type_on, name, file as file_name, uuid')
                   .joins("JOIN (#{ resource } UNION #{ user } UNION #{ project }) attached_obj ON attached_obj.obj_id = attachments.attached_on_id AND attached_obj.pol_type = attachments.attached_on_type")
                   .where(base_query, attached_type: @file_params[:attached_on_type], attached_id: @file_params[:attached_on_id])
                   .where(is_active: true)
                   .group_by{ |obj| obj.pol_type}

      @files['Resource'] = @files['Resource'].group_by{ |obj| obj.type_on } if @files['Resource'].present?
      @files['Resource'].map{ |k, v| @files['Resource'][k] = v.group_by{ |obj| obj.name }} if @files['Resource'].present?

SELECT user_accounts.id as obj_id, 'UserAccount' as pol_type, 'customer' as type_on, concat(first_name, ' ', last_name) as name FROM "user_accounts" WHERE "user_accounts"."company_id" = $1  [["company_id", 15]]
---
    def get_user
      UserAccount
          .select("user_accounts.id as obj_id, 'UserAccount' as pol_type, 'customer' as type_on, concat(first_name, ' ', last_name) as name")
          .where(company_id: @current_account.company_id, active: true)
          .to_sql

SELECT projects.id as obj_id, 'Project' as pol_type, title as type_on, title as name FROM "projects" INNER JOIN "user_accounts" ON "user_accounts"."id" = "projects"."user_account_id" WHERE "user_accounts"."company_id" = $1  [["company_id", 15]]
---
    def get_project
      Project
          .select("projects.id as obj_id, 'Project' as pol_type, title as type_on, title as name")
          .joins(:user_account)
          .where(user_accounts: { company_id: @current_account.company_id })
          .to_sql

SELECT  "attachments".* FROM "attachments" WHERE "attachments"."uuid" = $1 LIMIT $2  [["uuid", "606ba5cf-1ab4-4653-9c10-ca9cb8d05e6d"], ["LIMIT", 1]]
---
    def find_details_by_uuid
      @file = Attachment.find_by(uuid: @file_params[:uuid])