app/services/resources/resources_service.rb

    def get_external_resources
      Resource
          .select('resources.id, resources.name, description, external_resource_types.name as external_name')
          .joins(:resource_type)
          .joins('INNER JOIN external_resource_types on external_resource_types.id = resources.model_on_id')
          .where(company_id: @current_account.company_id, model_on_type: "ExternalResourceType", resource_types: { id_name: "external_resource"})
          .as_json
---
SELECT resources.id, resources.name, description, external_resource_types.name as external_name FROM "resources" INNER JOIN "resource_types" ON "resource_types"."id" = "resources"."resource_type_id" INNER JOIN external_resource_types on external_resource_types.id = resources.model_on_id WHERE "resources"."company_id" = $1 AND "resources"."model_on_type" = $2 AND "resource_types"."id_name" = $3  [["company_id", 15], ["model_on_type", "ExternalResourceType"], ["id_name", "external_resource"]]

    def get_resource_calendar
      Resource
          .select("project_id as id, start_time as start, deadline as end, assign_id, title, assign_type, status")
          .joins("LEFT JOIN  (#{ get_tasks_calendar } UNION #{ get_projects_calendar }) obj ON obj.resource_id = resources.id")
          .where(id: @params[:id])
          .as_json
---
SELECT project_id as id, start_time as start, deadline as end, assign_id, title, assign_type, status FROM "resources" LEFT JOIN  (SELECT resource_id, tasks.start_time, tasks.deadline FROM "task_resources" LEFT JOIN tasks ON tasks.id = task_resources.task_id UNION SELECT resource_id, projects.start_date as start_time, projects.deadline FROM "project_resources" LEFT JOIN projects ON projects.id = project_resources.project_id) obj ON obj.resource_id = resources.id WHERE "resources"."id" = $1  [["id", 3]]