app/services/resources/resources_service.rb

SELECT resources.id, resources.name, description, tool_models.name as tool_name FROM "resources" INNER JOIN "resource_types" ON "resource_types"."id" = "resources"."resource_type_id" INNER JOIN external_resource_types on external_resource_types.id = resources.model_on_id WHERE "resources"."model_on_type" = $1 AND "resource_types"."id_name" = $2  [["model_on_type", "ExternalResourceType"], ["id_name", "external_resource"]]
---
    def get_models
      Resource
          .select('resources.id, resources.name, description, machine_models.name as mod_name')
          .joins(:resource_type).joins('INNER JOIN machine_models on machine_models.id = resources.model_on_id')
          .where(model_on_type: "MachineModel", resource_types: { id_name: "machine"})
          .as_json

SELECT resources.id, resources.name, description, machine_models.name as mod_name FROM "resources" INNER JOIN "resource_types" ON "resource_types"."id" = "resources"."resource_type_id" INNER JOIN machine_models on machine_models.id = resources.model_on_id WHERE "resources"."model_on_type" = $1 AND "resource_types"."id_name" = $2  [["model_on_type", "MachineModel"], ["id_name", "machine"]]
---
    def get_tools
      Resource
          .select('resources.id, resources.name, description, tool_models.name as tool_name')
          .joins(:resource_type).joins('INNER JOIN tool_models on tool_models.id = resources.model_on_id')
          .where(model_on_type: "ToolModel", resource_types: { id_name: "tool"})
          .as_json

SELECT resources.id, resources.name, description, external_resource_types.name as external_name FROM "resources" INNER JOIN "resource_types" ON "resource_types"."id" = "resources"."resource_type_id" INNER JOIN external_resource_types on external_resource_types.id = resources.model_on_id WHERE "resources"."model_on_type" = $1 AND "resource_types"."id_name" = $2  [["model_on_type", "ExternalResourceType"], ["id_name", "external_resource"]]
---
    def get_external_resources
      Resource
          .select('resources.id, resources.name, description, external_resource_types.name as external_name')
          .joins(:resource_type)
          .joins('INNER JOIN external_resource_types on external_resource_types.id = resources.model_on_id')
          .where(model_on_type: "ExternalResourceType", resource_types: { id_name: "external_resource"})
          .as_json

DELETE FROM "resources" WHERE "resources"."id" = $1  [["id", 2]]
INSERT INTO "resources" ("resource_type_id", "model_on_type", "model_on_id", "name", "description") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["resource_type_id", 1], ["model_on_type", "MachineModel"], ["model_on_id", 2], ["name", "kaia kata"], ["description", "maaagari asworebs kata"]]
---
    def destroy
      find_resource
      return if @errors.any?
      @resource.delete
      @resource.save

SELECT  "resource_types".* FROM "resource_types" WHERE "resource_types"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def validate_resource_type
      resource_type = ResourceType.find_by_id(params[:resource_type_id])

UPDATE "resources" SET "name" = $1, "description" = $2 WHERE "resources"."id" = $3  [["name", "kaia chnageebiii"], ["description", "aba description"], ["id", 1]]
---
    def update_resource_obj
      find_resource
      @resource.update(params)

SELECT  "resources".* FROM "resources" WHERE "resources"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def find_resource
      @resource = Resource.find_by_id(params[:id])