app/services/resources/resources_service.rb

SELECT  "resource_types".* FROM "resource_types" WHERE "resource_types"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def validate_resource_type
      resource_type = ResourceType.find_by_id(params[:resource_type_id])

INSERT INTO "resources" ("resource_type_id", "model_on_type", "model_on_id", "name", "description", "company_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["resource_type_id", 2], ["model_on_type", "ToolModel"], ["model_on_id", 1], ["name", "aba testi"], ["description", "sdfsdfsdf"], ["company_id", 15]]
---
    def create_resource_obj
      return if errors.any?
      @resource = Resource.new(params)
      @resource.save
      @errors << fill_errors(@resource) if @resource.errors.any?