app/services/companies/companies_service.rb

    def destroy
      validate_destroy
      find_company
      return if @errors.any?
      @company.destroy
---
DELETE FROM "companies" WHERE "companies"."id" = $1  [["id", 9]]

    def company_list
      @companies = Company.where(parent_id: nil)
---
SELECT "companies".* FROM "companies" WHERE "companies"."parent_id" = $1  [["parent_id", 9]]

    def validate_destroy
      fill_custom_errors(self, :base,:invalid, I18n.t("You can not delete Company")) if Company.where(parent_id: params[:id]).present?
---
SELECT  1 AS one FROM "companies" WHERE "companies"."parent_id" = $1 LIMIT $2  [["parent_id", 9], ["LIMIT", 1]]

    def validate_country
      country = Country.find_by_id(params[:country_id])
---
SELECT  "countries".* FROM "countries" WHERE "countries"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

    def validate_city
      return if errors.any?
      city = City.find_by_id(params[:city_id])
---
SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]