app/services/companies/companies_service.rb

INSERT INTO "companies" ("name", "description", "address", "phone_number", "country_id", "city_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Bukas LTD"], ["description", "Software development company"], ["address", "Gogebashvili streat n10"], ["phone_number", "577520250"], ["country_id", 4], ["city_id", 9]]
UPDATE "companies" SET "active" = $1 WHERE "companies"."id" = $2  [["active", false], ["id", 12]]
INSERT INTO "companies" ("name", "description", "address", "phone_number", "country_id", "city_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Buka LTD"], ["description", "Software development company"], ["address", "Gogebashvili streat 13"], ["phone_number", "577520250"], ["country_id", 4], ["city_id", 9]]
---
    def destroy
      validate_destroy
      find_company
      return if @errors.any?
      @company.active = false
      @company.save
      @errors << fill_errors(@company) if @company.errors.any?

SELECT "companies".* FROM "companies" INNER JOIN "company_logos" ON "company_logos"."company_id" = "companies"."id" WHERE "companies"."parent_id" IS NULL
---
    def company_list
      @companies = Company.joins("LEFT JOIN company_logos ON company_logos.company_id = companies.id").where(parent_id: nil, active: true)

SELECT "companies".* FROM "companies" WHERE "companies"."parent_id" = $1  [["parent_id", 12]]
---
    def validate_destroy
      fill_custom_errors(self, :base,:invalid, I18n.t("You can not delete Company")) if Company.where(parent_id: params[:id]).present?

SELECT  "countries".* FROM "countries" WHERE "countries"."id" IS NULL LIMIT $1  [["LIMIT", 1]]
---
    def validate_country
      country = Country.find_by_id(params[:country_id])

SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
---
    def validate_city
      return if errors.any?
      city = City.find_by_id(params[:city_id])

INSERT INTO "companies" ("name", "description", "address", "phone_number", "legal_entity") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "qweqweqwe"], ["description", "qweqweqwe"], ["address", "qweqweqwe"], ["phone_number", "qweqweqwe"], ["legal_entity", "010203"]]
INSERT INTO "companies" ("name", "description", "address", "phone_number") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "base company"], ["description", "hey hey"], ["address", "gogebashvili streat"], ["phone_number", "577520250"]]
---
    def create_company_obj
      @company = Company.new(params)
      @company.save
      @errors << fill_errors(@company) if @company.errors.any?

INSERT INTO "companies" ("name", "description", "address", "phone_number", "legal_entity") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "aba aba aba"], ["description", "some description"], ["address", "string"], ["phone_number", "958494"], ["legal_entity", "653298"]]
---
    def update_company_obj
      find_company
      @company.update(params)
      @errors << fill_errors(@company) if @company.errors.any?

SELECT  "companies".* FROM "companies" LEFT JOIN company_logos ON company_logos.company_id = companies.id WHERE "companies"."id" = $1 AND "companies"."active" = $2 ORDER BY "companies"."id" DESC LIMIT $3  [["id", 12], ["active", true], ["LIMIT", 1]]
---
    def find_company
      @company = Company.joins("LEFT JOIN company_logos ON company_logos.company_id = companies.id").where(id: params[:id], active: true).last