app/services/companies/company_logo_service.rb

UPDATE "company_logos" SET "logo" = $1, "uuid" = $2 WHERE "company_logos"."id" = $3  [["logo", "Group_20721.png"], ["uuid", "5084daa2-6105-441f-ab67-b86c0a8227c1"], ["id", 1]]
---
    def create_company_logo
      @company_logo = CompanyLogo.where(company_id: @logo_params[:company_id]).first_or_initialize
      @company_logo.update(logo: @logo_params[:logo])