app/services/companies/company_logo_service.rb

INSERT INTO "company_logos" ("company_id", "logo", "uuid") VALUES ($1, $2, $3) RETURNING "id"  [["company_id", 12], ["logo", "bank_id.png"], ["uuid", "c6f47625-9b6c-4a8a-bb94-86ab62821e4e"]]
SELECT  "company_logos".* FROM "company_logos" WHERE "company_logos"."company_id" = $1 ORDER BY "company_logos"."id" ASC LIMIT $2  [["company_id", 45], ["LIMIT", 1]]
INSERT INTO "company_logos" ("company_id", "logo", "uuid") VALUES ($1, $2, $3) RETURNING "id"  [["company_id", 10], ["logo", "bank_id_new.png"], ["uuid", "38f2903f-1370-4e1c-98b8-023a97b4d61c"]]
---
    def create_company_logo
      @company_logo = CompanyLogo.new(@logo_params)
      @company_logo.save
      @errors << fill_errors(@company_logo) if @company_logo.errors.any?

SELECT  "company_logos".* FROM "company_logos" WHERE "company_logos"."uuid" = $1 LIMIT $2  [["uuid", "38f2903f-1370-4e1c-98b8-023a97b4d61c"], ["LIMIT", 1]]
---
    def find_details_by_uuid
      @company_logo = CompanyLogo.find_by(uuid: @logo_params[:uuid])
      fill_custom_errors(self, :base, :not_found, I18n.t("custom.errors.data_not_found")) unless @company_logo.present?