app/services/companies/department_logo_service.rb

INSERT INTO "department_logos" ("department_id", "logo", "uuid") VALUES ($1, $2, $3) RETURNING "id"  [["department_id", 1], ["logo", "bank_id_new.png"], ["uuid", "7ef2bc05-f348-4182-8a61-87b39b8f1070"]]
---
    def create_department_logo
      @department_logo = DepartmentLogo.new(@logo_params)
      @department_logo.save

SELECT  "department_logos".* FROM "department_logos" WHERE "department_logos"."uuid" = $1 LIMIT $2  [["uuid", "7ef2bc05-f348-4182-8a61-87b39b8f1070"], ["LIMIT", 1]]
---
    def find_details_by_uuid
      @department_logo = DepartmentLogo.find_by(uuid: @logo_params[:uuid])