app/services/companies/departments_service.rb

    def destroy
      validate_destroy
      find_department
      return if @errors.any?
      @department.destroy
---
DELETE FROM "departments" WHERE "departments"."id" = $1  [["id", 2]]

    def validate_destroy
      fill_custom_errors(self, :base,:invalid, I18n.t("You can not delete Company")) if Department.where(parent_id: params[:id]).present?
---
SELECT "departments".* FROM "departments" WHERE "departments"."parent_id" = $1  [["parent_id", 2]]

    def validate_country
      country = Country.find_by_id(params[:country_id])
---
SELECT  "countries".* FROM "countries" WHERE "countries"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

    def validate_city
      return if errors.any?
      city = City.find_by_id(params[:city_id])
---
SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]

    def validate_company
      return if errors.any?
      company = Company.find_by_id(params[:company_id])
---
SELECT  "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]

    def create_department_obj
      @department = Department.new(params)
      @department.save
      @errors << fill_errors(@department) if @department.errors.any?
---
INSERT INTO "departments" ("name", "description", "address", "phone_number", "country_id", "city_id", "company_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "HR department"], ["description", "This is HR department"], ["address", "tseretlis 123"], ["phone_number", "577520250"], ["country_id", 4], ["city_id", 9], ["company_id", 11]]
INSERT INTO "departments" ("name", "description", "address", "phone_number", "country_id", "city_id", "company_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "test"], ["description", "test"], ["address", "test"], ["phone_number", "test"], ["country_id", 4], ["city_id", 9], ["company_id", 10]]

    def update_department_obj
      find_department
      @department.update(params)
---
UPDATE "departments" SET "name" = $1, "description" = $2 WHERE "departments"."id" = $3  [["name", "HR department chnaged"], ["description", "This is changed HR department"], ["id", 1]]

    def find_department
      @department = Department.find(params[:id])
---
SELECT  "departments".* FROM "departments" WHERE "departments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]