app/services/companies/departments_service.rb

SELECT  "companies".* FROM "companies" WHERE "companies"."id" = $1 AND "companies"."active" = $2 ORDER BY "companies"."id" ASC LIMIT $3  [["id", 10], ["active", true], ["LIMIT", 1]]
---
    def validate_company
      return if errors.any?
      company = Company.where(id: params[:company_id], active: true).first