app/services/projects/projects_services.rb

SELECT user_accounts.id, first_name, last_name, 'employ' AS status FROM "user_accounts" INNER JOIN "user_account_projects" ON "user_account_projects"."user_account_id" = "user_accounts"."id" INNER JOIN "projects" ON "projects"."id" = "user_account_projects"."project_id" WHERE "projects"."id" = $1 GROUP BY user_accounts.id  [["id", 8]]
---
    def get_project_users(project)
      UserAccount
          .select('user_accounts.id, first_name, last_name, user_account_projects.id as project_user_id')
          .joins(user_account_projects: :project)
          .where(projects: {id: project.id })
          .group('user_accounts.id, user_account_projects.id').as_json

SELECT resources.id, resources.name, project_resources.id as project_resource_id FROM "resources" INNER JOIN "resource_types" ON "resource_types"."id" = "resources"."resource_type_id" INNER JOIN "project_resources" ON "project_resources"."resource_id" = "resources"."id" INNER JOIN "projects" ON "projects"."id" = "project_resources"."project_id" WHERE "resources"."model_on_type" = $1 AND "resource_types"."id_name" = $2 AND "projects"."id" = $3 GROUP BY resources.id, project_resources.id  [["model_on_type", "ExternalResourceType"], ["id_name", "external_resource"], ["id", 8]]
---
    def get_models(project)
      Resource
          .select('resources.id, resources.name, project_resources.id as project_resource_id')
          .joins(:resource_type, project_resources: :project)
          .where(model_on_type: "MachineModel", resource_types: { id_name: "machine"})
          .where(projects: {id: project.id })
          .group('resources.id, project_resources.id').as_json

SELECT user_accounts.id, first_name, last_name, 'employ' AS status FROM "user_accounts" INNER JOIN "user_account_tasks" ON "user_account_tasks"."user_account_id" = "user_accounts"."id" INNER JOIN "tasks" ON "tasks"."id" = "user_account_tasks"."task_id" INNER JOIN "projects" ON "projects"."id" = "tasks"."project_id" WHERE "projects"."id" = $1 GROUP BY user_accounts.id  [["id", 8]]
SELECT  "user_accounts".* FROM "user_accounts" WHERE "user_accounts"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
SELECT user_accounts.id, first_name, last_name, 'employ' AS status FROM "user_accounts" INNER JOIN "user_account_projects" ON "user_account_projects"."user_account_id" = "user_accounts"."id" INNER JOIN "projects" ON "projects"."id" = "user_account_projects"."project_id" WHERE "projects"."id" = $1 GROUP BY user_accounts.id  [["id", 8]]
---
    def get_members
      @members = UserAccount
                     .select("user_accounts.id, first_name, last_name, 'employ' AS status")
                     .joins(user_account_tasks: [task: :project])
                     .where(projects: { id: @project.id })
                     .group('user_accounts.id')
                     .as_json

      @members_other = get_other_members

      if @members_other.present?
        @members_other.each do |x|

SELECT first_name, last_name, start_time, deadline FROM "user_accounts" JOIN  (SELECT user_account_id as account_id, tasks.start_time, tasks.deadline FROM "user_account_tasks" LEFT JOIN tasks ON tasks.id = user_account_tasks.task_id UNION SELECT user_account_projects.user_account_id as account_id, projects.start_date as start_time, projects.deadline FROM "user_account_projects" LEFT JOIN projects ON projects.id = user_account_projects.project_id) obj ON obj.user_account_id = user_accounts.id WHERE "user_accounts"."id" = $1  [["id", 94]]
---
    def get_other_members
      UserAccount
          .select("user_accounts.id, first_name, last_name, 'employ' AS status")
          .joins(user_account_projects: :project)
          .where(projects: { id: @project.id })
          .group('user_accounts.id')
          .as_json

SELECT resources.id, name, resources.description FROM "resources" LEFT JOIN task_resources ON task_resources.resource_id = resources.id LEFT JOIN tasks ON task_resources.task_id = tasks.id LEFT JOIN project_resources ON project_resources.resource_id = resources.id LEFT JOIN projects ON tasks.project_id = projects.id OR project_resources.project_id = projects.id WHERE "projects"."id" = $1 GROUP BY resources.id  [["id", 8]]
---
    def get_resources
      @resources = Resource
                      .select("resources.id, name, resources.description")
                      .joins("LEFT JOIN task_resources ON task_resources.resource_id = resources.id")
                      .joins("LEFT JOIN tasks ON task_resources.task_id = tasks.id")
                      .joins("LEFT JOIN project_resources ON project_resources.resource_id = resources.id")
                      .joins("LEFT JOIN projects ON tasks.project_id = projects.id OR project_resources.project_id = projects.id")
                      .where(projects: { id: @project.id })
                      .group('resources.id')
                      .as_json