app/services/projects/projects_services.rb

    def create_project
      validate_dates
      return if errors.any?
      @project = Project.new(@params)
      @project.user_account_id = @current_user.id
      @project.project_id = generate_id
      @project.save
      @project << fill_errors(@project) if @project.errors.any?
---
INSERT INTO "projects" ("title", "description", "project_id", "address", "post_number", "contact_person", "user_account_id", "created_at", "updated_at", "start_date", "deadline") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
SELECT  "projects".* FROM "projects" ORDER BY "projects"."id" DESC LIMIT $1  [["LIMIT", 1]]

    def generate_id
      unic_id = ""
      if Project.last&.id.present?
        number = 5 - Project.last&.id&.to_s&.size.to_i
        number.times { unic_id += "0"}
        unic_id += (Project.last&.id.to_i + 1).to_s
---
SELECT  "projects".* FROM "projects" ORDER BY "projects"."id" DESC LIMIT $1  [["LIMIT", 1]]

    def overview
      @project = Project.find_by_id(@params[:id])
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]

    def get_members
      @members = UserAccount
                    .select("user_accounts.id, first_name, last_name, 'employ' AS status")
                    .joins(user_account_tasks: [task: :project])
                    .where(projects: { id: @project.id })
                    .group('user_accounts.id')
                    .as_json
      @members << {
          id: @project.user_account.id,
          first_name: @project.user_account.first_name,
          last_name: @project.user_account.last_name,
          status: "manager"
---
SELECT user_accounts.id, first_name, last_name, 'employ' AS status FROM "user_accounts" INNER JOIN "user_account_tasks" ON "user_account_tasks"."user_account_id" = "user_accounts"."id" INNER JOIN "tasks" ON "tasks"."id" = "user_account_tasks"."task_id" INNER JOIN "projects" ON "projects"."id" = "tasks"."project_id" WHERE "projects"."id" = $1 GROUP BY user_accounts.id  [["id", 5]]
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
SELECT user_accounts.id, first_name, last_name, 'employ' AS status FROM "user_accounts" LEFT JOIN user_account_tasks ON user_account_tasks.user_account_id = user_accounts.id LEFT JOIN tasks ON user_account_tasks.task_id = tasks.id LEFT JOIN user_account_projects ON user_account_projects.user_account_id = user_accounts.id LEFT JOIN projects ON tasks.project_id = projects.id OR user_account_projects.project_id = projects.id WHERE "projects"."id" = $1 GROUP BY user_accounts.id  [["id", 8]]

    def update_project
      find_project
      return if errors.any?
      validate_dates
      return if errors.any?
      @project.assign_attributes(@params)
      @project.save
---
UPDATE "projects" SET "title" = $1, "description" = $2, "address" = $3, "post_number" = $4, "contact_person" = $5, "start_date" = $6, "deadline" = $7, "updated_at" = $8 WHERE "projects"."id" = $9

    def delete_project
      find_project
      return if errors.any?
      find_tasks
      find_attachments
      ActiveRecord::Base.transaction do
        delete_tasks
        @attachments.delete_all
        @project.destroy
---
DELETE FROM "projects" WHERE "projects"."id" = $1  [["id", 1]]

    def delete_tasks
      @tasks.each do |t|
        user_tasks = UserAccountTask.where(task_id: t.id)
        resource_tasks = TaskResource.where(task_id: t.id)
        user_tasks.delete_all if user_tasks
        resource_tasks.delete_all if resource_tasks
---
DELETE FROM "user_account_tasks" WHERE "user_account_tasks"."task_id" = $1  [["task_id", 4]]
DELETE FROM "tasks" WHERE "tasks"."project_id" = $1  [["project_id", 1]]
DELETE FROM "task_resources" WHERE "task_resources"."task_id" = $1  [["task_id", 4]]

    def find_project
      @project = Project.find_by_id(@params[:id])
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]