app/services/suppliers/supplier_products_service.rb

UPDATE "supplier_products" SET "product_id" = $1, "supplier_code" = $2, "quantity" = $3, "updated_at" = $4 WHERE "supplier_products"."id" = $5  [["product_id", 2], ["supplier_code", "0066"], ["quantity", 20], ["updated_at", "2020-09-29 21:41:33.961357"], ["id", 7]]
---
    def update_supplier_product
      find_supplier_product
      @supplier_product.update(@supplier_product_params.as_json(except: :id))

SELECT  "supplier_products".* FROM "supplier_products" WHERE "supplier_products"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def find_supplier_product
      @supplier_product = SupplierProduct.find_by_id(@supplier_product_params[:id])

INSERT INTO "supplier_products" ("supplier_id", "product_id", "supplier_code", "created_at", "updated_at", "quantity") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["supplier_id", 4], ["product_id", 15], ["supplier_code", "0055"], ["created_at", "2020-09-29 18:30:23.809969"], ["updated_at", "2020-09-29 18:30:23.809969"], ["quantity", 23]]
---
    def create_item
      return if errors.any?
      binding.pry
      @supplier_product = SupplierProduct.new(@supplier_product_params)
      @supplier_product.save
      @errors << fill_errors(@supplier_product) if @supplier_product.errors.any?

SELECT  "suppliers".* FROM "suppliers" WHERE "suppliers"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
    def validate_supplier!
      supplier = Supplier.find_by_id(@supplier_product_params[:supplier_id])

SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
---
    def validate_product!
      product = Product.find_by_id(@supplier_product_params[:product_id])