app/services/suppliers/supplier_products_service.rb

UPDATE "supplier_products" SET "is_active" = $1, "updated_at" = $2 WHERE "supplier_products"."id" = $3  [["is_active", true], ["updated_at", "2020-09-29 21:56:04.520817"], ["id", 7]]
---
    def update_supplier_product
      find_supplier_product
      @supplier_product.update(@supplier_product_params)

SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
SELECT  "supplier_products".* FROM "supplier_products" WHERE "supplier_products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def find_supplier_product
      @supplier_product = SupplierProduct.find_by_id(@supplier_product_params[:id])