app/services/suppliers/supplier_helper_service.rb

SELECT "business_types".* FROM "business_types"
---
    def business_types
      @business_type = BusinessType.all

SELECT "integration_systems".* FROM "integration_systems"
---
    def integrations_systems
      @integration_systems = IntegrationSystem.all