app/services/suppliers/suppliers_service.rb

SELECT  "suppliers".* FROM "suppliers" WHERE "suppliers"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "suppliers" SET "active" = $1 WHERE "suppliers"."id" = $2  [["active", false], ["id", 3]]
---
    def update_supplier
      @supplier = Supplier.find(@supplier_params[:id])
      @supplier.update(@supplier_params.except(:id))

SELECT  "suppliers".* FROM "suppliers" WHERE "suppliers"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def destroy_supplier
      @supplier = Supplier.find(@supplier_params[:id])