app/controllers/attachments_controller.rb

INSERT INTO "attachments" ("attached_on_type", "attached_on_id", "file", "uuid", "exp_date") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["attached_on_type", "Resource"], ["attached_on_id", 3], ["file", "Anzor_Urdia_CV__1_.pdf"], ["uuid", "26ec2d21-8775-48c5-b1de-0e74b0f8e2db"], ["exp_date", "2021-02-23 00:00:00"]]
---
  def create
    service = Resources::AttachmentsService.new(file_params)
    service.create_file