app/controllers/clients_controller.rb

INSERT INTO "clients" ("name", "address", "user_account_id", "country_id", "city_id", "clients_group_id", "clients_type_id", "currency_id", "phone", "web_address", "kunde_nr", "created_at", "updated_at", "product_vat_type_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14) RETURNING "id"
---
  def create
    service = Clients::Service.new(clients_params)
    service.create_client