app/controllers/companies_controller.rb

INSERT INTO "companies" ("name", "description", "address", "phone_number", "countries_id", "cities_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Bukas LTD"], ["description", "Software development company"], ["address", "Gogebashvili streat n10"], ["phone_number", "577520250"], ["countries_id", 3], ["cities_id", 8]]
---
  def create
    service = Companies::CompaniesService.new(company_params)
    service.create_company

DELETE FROM "companies" WHERE "companies"."id" = $1  [["id", 9]]
---
  def destroy
    service = Companies::CompaniesService.new(company_params)
    service.destroy

SELECT  "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT $2  [["id", 19], ["LIMIT", 1]]
---
  def current_company
    Company.find_by_id(params[:company_id])