app/controllers/company_logos_controller.rb

  def create
    service = Companies::CompanyLogoService.new(logo_params)
    service.create_company_logo
---
INSERT INTO "company_logos" ("company_id", "logo", "uuid") VALUES ($1, $2, $3) RETURNING "id"  [["company_id", 10], ["logo", "bank_id_new.png"], ["uuid", "38f2903f-1370-4e1c-98b8-023a97b4d61c"]]