app/controllers/department_logos_controller.rb

INSERT INTO "department_logos" ("department_id", "logo", "uuid") VALUES ($1, $2, $3) RETURNING "id"  [["department_id", 1], ["logo", "bank_id_new.png"], ["uuid", "7ef2bc05-f348-4182-8a61-87b39b8f1070"]]
---
  def create
    service = Companies::DepartmentLogoService.new(logo_params)
    service.create_department_logo