app/controllers/departments_controller.rb

INSERT INTO "departments" ("name", "description", "address", "phone_number", "country_id", "city_id", "company_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "HR department"], ["description", "This is HR department"], ["address", "tseretlis 123"], ["phone_number", "577520250"], ["country_id", 4], ["city_id", 9], ["company_id", 11]]
---
  def create
    service = Companies::DepartmentsService.new(department_params)
    service.create_department

DELETE FROM "departments" WHERE "departments"."id" = $1  [["id", 2]]
---
  def destroy
    service = Companies::DepartmentsService.new(department_params)
    service.destroy