app/controllers/orders_controller.rb

INSERT INTO "orders" ("title", "description", "client_id", "order_type_id", "order_status_id", "user_account_id", "start_time", "deadline", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    service = Orders::OrdersServices.new(orders_params)
    service.create_order

SELECT "orders".* FROM "orders"
---
  def orders_list
    service = Orders::OrdersServices.new(orders_params)
    service.order_list