app/controllers/order_products_controller.rb

INSERT INTO "order_products" ("product_id", "order_id", "count") VALUES ($1, $2, $3) RETURNING "id"  [["product_id", 15], ["order_id", 6], ["count", 23]]
---
  def create
    service = Orders::OrderProductsServices.new(order_product_params)
    service.create_order_product

SELECT "order_products".* FROM "order_products" WHERE "order_products"."order_id" = $1  [["order_id", 5]]
---
  def order_products_list
    service = Orders::OrderProductsServices.new(order_product_params)
    service.order_products_list

DELETE FROM "order_products" WHERE "order_products"."id" = $1  [["id", 2]]
---
  def destroy
    service = Orders::OrderProductsServices.new(order_product_params)
    service.delete_order_prod