app/controllers/product_types_controller.rb

  def create
    service = Products::ProductTypeService.new(product_type_params)
    service.create
---
INSERT INTO "product_types" ("name", "id_name") VALUES ($1, $2) RETURNING "id"  [["name", "{\"no\":\"aba1\",\"en\":\"aba1\"}"], ["id_name", "aba1"]]

  def destroy
    service = Products::ProductTypeService.new(product_type_params)
    service.destroy
---
DELETE FROM "product_types" WHERE "product_types"."id" = $1  [["id", 4]]