app/controllers/products_controller.rb

  def create
    service = Products::ProductCreateService.new(product_params)
    service.create_product
---
INSERT INTO "products" ("name", "full_name", "description", "code", "instruction") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "{\"en\":\"buka\"}"], ["full_name", "{\"en\":\"full buka\"}"], ["description", "Test product"], ["code", "20569"], ["instruction", "Take cerfule with this product"]]

  def destroy
    service = Products::ProductDestroyService.new(product_params)
    service.destroy_product
---
DELETE FROM "products" WHERE "products"."id" = $1  [["id", 15]]