app/controllers/projects_controller.rb

INSERT INTO "projects" ("title", "description", "project_id", "address", "post_number", "contact_person", "user_account_id", "created_at", "updated_at", "start_date", "deadline") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
  def create
    service = Projects::ProjectsServices.new(project_params, current_account, current_company)
    service.create_project

DELETE FROM "projects" WHERE "projects"."id" = $1  [["id", 1]]
---
  def destroy
    service = Projects::ProjectsServices.new(project_params, current_account, current_company)
    service.delete_project