app/controllers/resources_controller.rb

INSERT INTO "resources" ("resource_type_id", "model_on_type", "model_on_id", "name", "description", "company_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["resource_type_id", 2], ["model_on_type", "ToolModel"], ["model_on_id", 1], ["name", "aba testi"], ["description", "sdfsdfsdf"], ["company_id", 15]]
---
  def create
    service = Resources::ResourcesService.new(current_account, resource_params)
    service.create_resource

DELETE FROM "resources" WHERE "resources"."id" = $1  [["id", 2]]
---
  def destroy
    service = Resources::ResourcesService.new(current_account, resource_params)
    service.destroy