app/controllers/settings_controller.rb

  def destroy_machine_model
    service = Settings::ModelsService.new(current_account,models_params)
    service.destroy_machine_model
---
DELETE FROM "machine_models" WHERE "machine_models"."id" = $1  [["id", 1]]

  def destroy_tool_model
    service = Settings::ModelsService.new(current_account,models_params)
    service.destroy_tool_model
---
DELETE FROM "tool_models" WHERE "tool_models"."id" = $1  [["id", 2]]

  def destroy_country
    service = Settings::CountryAndCityService.new(country_params)
    service.destroy_country
---
DELETE FROM "countries" WHERE "countries"."id" = $1  [["id", 1]]

  def destroy_city
    service = Settings::CountryAndCityService.new(city_params)
    service.destroy_city
---
DELETE FROM "cities" WHERE "cities"."id" = $1  [["id", 7]]
DELETE FROM "countries" WHERE "countries"."id" = $1  [["id", 2]]