app/controllers/supplier_products_controller.rb

  def create
    service = Supplier::SupplierProductsService.new(supplier_product_params)
    service.create_supplier_product
---
INSERT INTO "supplier_products" ("supplier_id", "product_id", "supplier_code", "created_at", "updated_at", "quantity") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["supplier_id", 4], ["product_id", 15], ["supplier_code", "0055"], ["created_at", "2020-09-29 18:30:23.809969"], ["updated_at", "2020-09-29 18:30:23.809969"], ["quantity", 23]]