app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("title", "description", "task_status_id", "product_id", "order_id", "user_account_id", "start_time", "deadline", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    service = Tasks::Services.new(task_params, current_account, current_company)
    service.create_ta

DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 2]]
---
  def destroy
    service = Tasks::Services.new(task_params, current_account, current_company)
    service.delete_task