app/controllers/user_roles_controller.rb

DELETE FROM "user_roles" WHERE "user_roles"."id" = $1  [["id", 4]]
---
  def destroy
    service = Account::UserRoleManagementService.new(user_role_params)
    service.destroy_user_role