app/services/account/confirmation_service.rb

UPDATE "user_accounts" SET "active" = $1, "updated_at" = $2 WHERE "user_accounts"."id" = $3  [["active", true], ["updated_at", "2020-10-21 11:00:44.469323"], ["id", 56]]
---
      def set_active!(verification_service)
        user = verification_service.verification.user_account
        user.active = true
        user.save!

SELECT  "confirmation_codes".* FROM "confirmation_codes" WHERE "confirmation_codes"."confirmation_token" = $1 LIMIT $2  [["confirmation_token", "Hn8cREkCP8fxaA51ei3ufQkR"], ["LIMIT", 1]]
---
      def validate_token(verification_service)
        return if errors.any?
        code = ConfirmationCode.find_by_confirmation_token(verification_service.verification&.confirmation_token)