app/services/account/registration_service.rb

INSERT INTO "user_accounts" ("phone_number", "email", "crypted_password", "created_at", "updated_at", "salt", "username", "phone_number_iso", "first_name", "last_name", "company_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
    def register_user!
      @user = UserAccount.new(@registration_params.slice(:phone_number, :phone_number_iso, :email, :password, :username, :first_name, :last_name))
      @user.company_id = @current_company.id
      @user.save

INSERT INTO "customers" ("user_account_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_account_id", 94], ["created_at", "2021-05-08 09:37:11.125104"], ["updated_at", "2021-05-08 09:37:11.125104"]]
---
    def create_customer!
      return if @errors.any?
      @customer = Customer.create!(customer_object)