app/services/account/registration_service.rb

    def create_terms_and_conditions
      return if @errors.any?
      TermsAndConditionAgreement.create!(user_account_id: @user.id,
                                         terms_and_condition_id: @registration_params[:terms_and_conditions_id],
                                         agreed_date: DateTime.now)
---
INSERT INTO "user_accounts" ("phone_number", "email", "crypted_password", "created_at", "updated_at", "salt", "username", "phone_number_iso") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"