app/services/account/registration_service.rb

    def add_default_role!
      return if @current_company.nil?
      if UserAccount.where(company_id: @current_company.id).count != 1
        UserRole.create(user_account_id: @user.id, role_group_id: RoleGroup.find_by_id_name("employee").id)
      else
        UserRole.create(user_account_id: @user.id, role_group_id: RoleGroup.find_by_id_name("super_admin").id)
---
INSERT INTO "user_roles" ("user_account_id", "role_group_id") VALUES ($1, $2) RETURNING "id"  [["user_account_id", 97], ["role_group_id", 10]]
SELECT  "role_groups".* FROM "role_groups" WHERE "role_groups"."id_name" = $1 LIMIT $2  [["id_name", "employee"], ["LIMIT", 1]]
SELECT  "role_groups".* FROM "role_groups" WHERE "role_groups"."id_name" = $1 LIMIT $2  [["id_name", "super_admin"], ["LIMIT", 1]]

    def set_active!(verification_service)
      user = verification_service.verification.user_account
      user.active = true
      user.save!
---
UPDATE "user_accounts" SET "active" = $1, "updated_at" = $2 WHERE "user_accounts"."id" = $3  [["active", true], ["updated_at", "2021-06-28 21:15:51.218629"], ["id", 97]]

    def validate_token(verification_service)
      return if errors.any?
      code = ConfirmationCode.find_by_confirmation_token(verification_service.verification&.confirmation_token)
---
SELECT  "confirmation_codes".* FROM "confirmation_codes" WHERE "confirmation_codes"."confirmation_token" = $1 LIMIT $2  [["confirmation_token", "9JK3NBakEY1FXyoSFCH5zGWu"], ["LIMIT", 1]]

    def validate_customer_type
      id_name = CustomerType.find_by_id_name(:multi_business_customer).id_name
---
SELECT  "customer_types".* FROM "customer_types" WHERE "customer_types"."id_name" = $1 LIMIT $2  [["id_name", "private_customer"], ["LIMIT", 1]]

    def validate_username
      if UserAccount.where(username: @registration_params[:username], company_id: @current_company&.id, active: true).any?
---
SELECT  1 AS one FROM "user_accounts" WHERE "user_accounts"."username" = $1 AND "user_accounts"."company_id" = $2 AND "user_accounts"."active" = $3 LIMIT $4  [["username", "ninonino"], ["company_id", 19], ["active", true], ["LIMIT", 1]]

    def register_user!
      @user = UserAccount.new(@registration_params.slice(:phone_number, :phone_number_iso, :email, :password, :username, :first_name, :last_name))
      @user.company_id = @current_company.id if @current_company.present?
      @user.save
---
INSERT INTO "user_accounts" ("phone_number", "email", "crypted_password", "created_at", "updated_at", "salt", "username", "phone_number_iso", "first_name", "last_name", "company_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"

    def create_customer!
      return if @errors.any?
      @customer = Customer.create!(customer_object)
---
INSERT INTO "customers" ("user_account_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_account_id", 97], ["created_at", "2021-06-28 21:14:05.795517"], ["updated_at", "2021-06-28 21:14:05.795517"]]