app/services/account/user_role_management_service.rb

    def validate_role!
      return if errors.any?
      @role_group = RoleGroup.find(params[:role_group_id])
---
SELECT  "role_groups".* FROM "role_groups" WHERE "role_groups"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]