app/services/account/users_service.rb

    def deactivate_user
      @user = UserAccount.find(params[:id])
      @user.active = false
      @user.save
---
SELECT  "user_accounts".* FROM "user_accounts" WHERE "user_accounts"."id" = $1 LIMIT $2  [["id", 95], ["LIMIT", 1]]
UPDATE "user_accounts" SET "active" = $1, "updated_at" = $2 WHERE "user_accounts"."id" = $3  [["active", false], ["updated_at", "2021-06-11 21:40:09.824210"], ["id", 95]]

    def get_calendar_dates
      UserAccount
          .select("project_id as id, start_time as start, deadline as end, assign_id, title, assign_type, status")
          .joins("LEFT JOIN  (#{ get_tasks_calendar } UNION #{ get_projects_calendar }) obj ON obj.account_id = user_accounts.id")
          .where(id: @params[:id])
          .as_json
---
SELECT tasks.start_time, tasks.deadline FROM "user_accounts" LEFT JOIN user_account_tasks ON user_account_tasks.user_account_id = user_accounts.id LEFT JOIN tasks ON tasks.id = user_account_tasks.task_id WHERE "user_accounts"."id" = $1  [["id", 39]]