app/services/account/user_role_management_service.rb

    def find_user_role
      @user_role = UserRole.find(params[:id])
---
SELECT  "user_roles".* FROM "user_roles" WHERE "user_roles"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

    def validate_destroy!
      if UserRole.where(user_account_id: @user_role.user_account_id).count < 2
---
SELECT COUNT(*) FROM "user_roles" WHERE "user_roles"."user_account_id" = $1  [["user_account_id", 51]]

    def destroy
      return if errors.any?
      @user_role.destroy
      @errors << fill_errors(@user_role) if @user_role.errors.any?
---
DELETE FROM "user_roles" WHERE "user_roles"."id" = $1  [["id", 4]]
INSERT INTO "user_roles" ("user_account_id", "role_group_id") VALUES ($1, $2) RETURNING "id"  [["user_account_id", 52], ["role_group_id", 4]]

    def validate_user!
      return if errors.any?
      @user = UserAccount.find(params[:user_account_id])
---
SELECT  "user_accounts".* FROM "user_accounts" WHERE "user_accounts"."id" = $1 LIMIT $2  [["id", 94], ["LIMIT", 1]]

    def validate_role!
      return if errors.any?
      @role_group = RoleGroup.find(params[:role_group_id])
---
SELECT  "role_groups".* FROM "role_groups" WHERE "role_groups"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]

    def create_user_role
      return if errors.any?
      @user_role = UserRole.where(user_account_id: @user.id).first_or_initialize
      @user_role.role_group_id =  @role_group.id
      @user_role.save
      @errors << fill_errors(@user_role) if @user_role.errors.any?
---
SELECT  "user_roles".* FROM "user_roles" WHERE "user_roles"."user_account_id" = $1 ORDER BY "user_roles"."id" ASC LIMIT $2  [["user_account_id", 51], ["LIMIT", 1]]
UPDATE "user_roles" SET "role_group_id" = $1 WHERE "user_roles"."id" = $2  [["role_group_id", 5], ["id", 6]]
SELECT  "user_roles".* FROM "user_roles" WHERE "user_roles"."user_account_id" = $1 AND "user_roles"."role_group_id" = $2 ORDER BY "user_roles"."id" ASC LIMIT $3  [["user_account_id", 51], ["role_group_id", 5], ["LIMIT", 1]]
INSERT INTO "user_roles" ("user_account_id", "role_group_id") VALUES ($1, $2) RETURNING "id"  [["user_account_id", 51], ["role_group_id", 5]]