app/services/account/user_role_management_service.rb

    def validate_role!
      return if errors.any?
      @role_group = RoleGroup.find_by_id_name(params[:id_name])
---
SELECT  "role_groups".* FROM "role_groups" WHERE "role_groups"."id_name" = $1 LIMIT $2  [["id_name", "employee"], ["LIMIT", 1]]