app/services/account/verification_service.rb

    def initialize(params)
      @user = params[:user]
      @token = params[:token]

      @confirmation_type = params[:confirmation_type] || 'registration'

      @verification = ConfirmationCode.find_by_confirmation_token(token) if token
---
SELECT  "confirmation_codes".* FROM "confirmation_codes" WHERE "confirmation_codes"."confirmation_token" = $1 LIMIT $2  [["confirmation_token", "RcGEJXRGjNTZ3EVxGhWEM9zw"], ["LIMIT", 1]]

    def generate_codes
      type_record = ConfirmationType.find_by_id_name(@confirmation_type)
      @verification = ConfirmationCode.where(user_account_id: @user.id, confirmation_type: type_record).first_or_initialize
---
SELECT  "confirmation_types".* FROM "confirmation_types" WHERE "confirmation_types"."id_name" = $1 LIMIT $2  [["id_name", "registration"], ["LIMIT", 1]]
SELECT  "confirmation_codes".* FROM "confirmation_codes" WHERE "confirmation_codes"."user_account_id" = $1 AND "confirmation_codes"."confirmation_type_id" = $2 ORDER BY "confirmation_codes"."id" ASC LIMIT $3  [["user_account_id", 53], ["confirmation_type_id", 2], ["LIMIT", 1]]