app/services/products/product_create_service.rb

SELECT  "product_types".* FROM "product_types" WHERE "product_types"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
    def validate_type!
      product_type = ProductType.find_by_id(@product_params[:product_characteristic_attributes][:product_type_id])

SELECT  "product_vat_types".* FROM "product_vat_types" WHERE "product_vat_types"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def validate_vat_type!
      return if @errors.any?
      product_vat_type = ProductVatType.find_by_id(@product_params[:product_characteristic_attributes][:product_vat_type_id])

INSERT INTO "products" ("name", "full_name", "description", "code", "instruction") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
INSERT INTO "products" ("name", "full_name", "description", "code", "instruction") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "{\"en\":\"buka\"}"], ["full_name", "{\"en\":\"full buka\"}"], ["description", "Test product"], ["code", "20569"], ["instruction", "Take cerfule with this product"]]
---
    def create_product_item
      return if @errors.any?
      @product = Product.new(@product_params)
      @product.save
      @errors << fill_errors(@product) if @product.errors.any?