app/services/products/product_type_service.rb

INSERT INTO "product_types" ("name", "id_name") VALUES ($1, $2) RETURNING "id"  [["name", "{\"no\":\"aba1\",\"en\":\"aba1\"}"], ["id_name", "aba1"]]
SELECT "product_types".* FROM "product_types"
---
    def create
      @product_type = ProductType.new(@params)
      @product_type.id_name = @params[:name]["en"].downcase.parameterize(separator: '_')
      @product_type.save

      @errors << fill_errors(@product_type) if @product_type.errors.any?

UPDATE "product_types" SET "name" = $1 WHERE "product_types"."id" = $2  [["name", "{\"no\":\"aba 2\",\"en\":\"aba 2\"}"], ["id", 4]]
---
    def update
      find_type
      return if errors.any?
      @product_type.assign_attributes(@params)
      @product_type.save

DELETE FROM "product_types" WHERE "product_types"."id" = $1  [["id", 4]]
---
    def destroy
      find_type
      return if @errors.any?
      @product_type.destroy

SELECT  "product_types".* FROM "product_types" WHERE "product_types"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
    def find_type
      @product_type = ProductType.find_by_id(@params[:id])