app/services/products/product_price_service.rb

SELECT  "product_prices".* FROM "product_prices" WHERE "product_prices"."product_id" = $1 LIMIT $2  [["product_id", 15], ["LIMIT", 1]]
---
      def find_product_prices
        @product_price = ProductPrice.find_by(product_id: price_params[:product_id])

SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
---
      def validate_product
        product = Product.find(price_params[:product_id])

UPDATE "product_prices" SET "list_price_type" = $1, "list_price_amount" = $2, "manufacturing_cost" = $3, "updated_at" = $4 WHERE "product_prices"."id" = $5  [["list_price_type", "percent"], ["list_price_amount", "50.0"], ["manufacturing_cost", "200.0"], ["updated_at", "2020-10-02 23:05:45.999521"], ["id", 1]]
---
      def first_or_initialize_price
        @product_price = ProductPrice.where(product_id: price_params[:product_id]).first_or_initialize
        @product_price.update(list_price_type: price_params[:list_price_type],
                              list_price_amount: price_params[:list_price_amount],
                              manufacturing_cost: price_params[:manufacturing_cost])

SELECT "supplier_products".* FROM "supplier_products" WHERE "supplier_products"."product_id" = $1  [["product_id", 15]]
---
      def calculation
        @supplier_product = SupplierProduct.where(product_id: @product_price.product_id)
        @price_data = []
        if @supplier_product.present?

SELECT  "supplier_product_prices".* FROM "supplier_product_prices" WHERE "supplier_product_prices"."supplier_product_id" = $1 LIMIT $2  [["supplier_product_id", 9], ["LIMIT", 1]]
SELECT  "suppliers".* FROM "suppliers" WHERE "suppliers"."id" IS NULL LIMIT $1  [["LIMIT", 1]]
---
    def set_prices(supplier_product = nil)
      cost_price = @product_price.manufacturing_cost.to_d + supplier_product&.supplier_product_price&.price.to_d
      {
          supplier: Supplier.find_by_id(supplier_product&.supplier_id)&.name,
          manufacturing_cost: @product_price.manufacturing_cost.to_d,
          purchase_price: supplier_product&.supplier_product_price&.price&.to_d,
          cost_price: cost_price,
          list_price: @product_price.list_price_type.eql?("fix_price") ? cost_price + @product_price.list_price_amount.to_d :