app/services/products/product_list_service.rb

    def list
      @product = Product.all
---
SELECT "products".* FROM "products"