app/services/products/product_destroy_service.rb

    def destroy_product
      @product = Product.find(@product_params[:id])
      @product.active = false
      @product.save
---
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
UPDATE "products" SET "active" = $1 WHERE "products"."id" = $2  [["active", false], ["id", 2]]