app/services/products/product_destroy_service.rb

DELETE FROM "products" WHERE "products"."id" = $1  [["id", 15]]
---
    def destroy_product
      @product = Product.find(@product_params[:id])
      @product.destroy