app/services/products/product_list_service.rb

    def list
      @product = Product.where(active: true)
---
SELECT "products".* FROM "products" WHERE "products"."active" = $1  [["active", true]]

    def product_vat_types
      @product_vat_types = ProductVatType.all
---
SELECT "product_vat_types".* FROM "product_vat_types"