app/services/products/product_update_service.rb

SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def update_product
      @product = Product.find(@product_params[:id])
      @product.update(@product_params.as_json(except: :id))
      @errors << fill_errors(@product) if @product.errors.any?